<?php

header("Content-Type: text/html;charset=utf-8");

echo("<h1>Домашняя работа 3</h1><br>");
echo("<h2>С помощью цикла while вывести все числа в промежутке от 0 до 100, которые делятся на 3 без остатка</h2><br>");

$i = 1;
while ($i <= 100) {
    If($i%3==0){
        echo $i;
        echo " ";
    }
    
    $i++;
}

echo("<h2>2. С помощью цикла do…while написать функцию для вывода чисел от 0 до 10, чтобы результат выглядел так</h2><br>");

$i = -1;
do {
    $i++;
    if($i == 0){
        echo "0 - это ноль<br>";
        continue;
    }
    $o =$i%2;
    if($o==0){
        echo "{$i} - это четное число<br>";
    }else{
        echo "{$i} - это нечетное число<br>";
    }
} while ($i < 10);

echo("<h2>3. Объявить массив, в котором в качестве ключей будут использоваться названия областей, а в качестве значений – массивы с названиями городов из соответствующей области. Вывести в цикле значения массива, чтобы результат был таким:</h2><br>");


$regions_cities = [
    "Московская область" => ["Москва", "Зеленоград", "Клин", "Химки", "Серпухов"],
    "Ленинградская область" => ["Санкт-Петербург","Всеволожск","Павловск","Кронштадт"],
    "Рязанская область" => ["Рязань","Касимов","Кораблино","Михайлов", "Новомичуринск"]
];

foreach($regions_cities as $region => $array_cities){
    echo "{$region}:";
    echo "<br>";
    $cities = "";
    foreach($array_cities  as  $inner_key => $value){
        if($cities <> ""){
            $cities .= ", " . $value;
        }else{
            $cities = $value;
        };
    }
    echo "{$cities}";
    echo "<br>";
}

echo("<h2>4. Объявить массив, индексами которого являются буквы русского языка, а значениями – соответствующие латинские буквосочетания (‘а’=> ’a’, ‘б’ => ‘b’, ‘в’ => ‘v’, ‘г’ => ‘g’, …, ‘э’ => ‘e’, ‘ю’ => ‘yu’, ‘я’ => ‘ya’).</h2><br>");

function translit(string $s) {
    $translit = [   "а"=>"a","б"=>"b","в"=>"v","г"=>"g","д"=>"d","е"=>"e","ё"=>"e","ж"=>"j","з"=>"z","и"=>"i","й"=>"y","к"=>"k","л"=>"l","м"=>"m","н"=>"n","о"=>"o","п"=>"p","р"=>"r","с"=>"s","т"=>"t","у"=>"u","ф"=>"f","х"=>"h","ц"=>"c","ч"=>"ch","ш"=>"sh","щ"=>"shch","ы"=>"y","э"=>"e","ю"=>"yu","я"=>"ya","ъ"=>"'","ь"=>"'","А"=>"A","Б"=>"B","В"=>"V","Г"=>"G","Д"=>"D","Е"=>"E","Ё"=>"E","Ж"=>"J","З"=>"Z","И"=>"I","Й"=>"Y","К"=>"K","Л"=>"L","М"=>"M","Н"=>"N","О"=>"O","П"=>"P","Р"=>"R","С"=>"S","Т"=>"T","У"=>"U","Ф"=>"F","Х"=>"H","Ц"=>"C","Ч"=>"Ch","Ш"=>"Sh","Щ"=>"Shch","Ы"=>"Y","Э"=>"E","Ю"=>"Yu","Я"=>"Ya","Ъ"=>"'","Ь"=>"'"];

    //$s = strtr($s, $translit);
    
    $res = "";
    for ($i = 0; $i <= strlen ($s); $i++) {
        $res .= ($translit[mb_substr($s,$i,1,"UTF-8")] == "") ? mb_substr($s,$i,1,"UTF-8") : $translit[mb_substr($s,$i,1,"UTF-8")];
        
    }

    
    return $res; // возвращаем результат
}


echo translit("Во поле береза стояла и автомобиль");

echo("<h2>5. Написать функцию, которая заменяет в строке пробелы на подчеркивания и возвращает видоизмененную строчку.</h2><br>");

function replace_spaces(string $s) {
    return implode ( "_" , explode ( " " , $s));
}

echo replace_spaces("Заменить в этой строке все пробелы на подчеркивания");

echo("<h2>6. В имеющемся шаблоне сайта заменить статичное меню (ul – li) на генерируемое через PHP. Необходимо представить пункты меню как элементы массива и вывести их циклом. Подумать, как можно реализовать меню с вложенными подменю? Попробовать его реализовать.</h2><br>");

$menus = [
    "menu1" => ["item1", "item2", "item3", "item4", "item5"],
    "menu2" => ["item1", "item2", "item3", "item4", "item5"],
    "menu3" => ["item1", "item2", "item3", "item4", "item5"]
];

foreach($menus as $menu_name => $items){
    echo "{$menu_name}:";
    echo "<ul>";
    
    $cities = "";
    foreach($items  as  $inner_key => $value){
        echo "<li>";
        echo "$value";
        echo "</li>";
    }
    echo "{$cities}";
    echo "</ul>";
}


?>
